export default function Openmind() {
  return (
    <p>
      리액트로 진행 한 첫 팀프로젝트인 익명 질의응답 서비스 오픈마인드 입니다.{" "}
      <br />
      <br />
      스타일드 컴포넌트를 사용하여 props에 따른 동적 스타일링에 대해 알게
      되었고, 프로젝트내내 유용하게 써먹었던 기억이 있습니다.
      <br />
      <br />
      로컬스토리지로 사용자 정보를 저장해서 다음에 접속할때도 내가 개설했던
      섹션에서 답변이 가능하게 구현하였습니다.
      <br />
      <br />또 처음으로 진행한 팀 프로젝트 였던 만큼 pr을 올려보고, 코드리뷰에
      대한 피드백을 진행하고, disscusion에 회고를 작성하는 등 github를 통한
      협업이 어떻게 이루어지는지 경험하였으며, 팀원이 다같이 모여 제공된 시안의
      화면흐름도나 백엔드api가 어떻게 설계되었는지 뜯어보면서 연구했던것들이
      뜻깊은 경험들이었습니다.
    </p>
  );
}
